backend-api/app/Controllers/Api/Buku.php

    public function delete($id = null)
    {
        $model = new BukuModel();
        $data = $model->where('id', $id)->first();
        if ($data) {
            $model->delete($id);
---
SELECT *
FROM `buku`
WHERE `id` = '4'
 LIMIT 1
DELETE FROM `buku`
WHERE `id` IN ('4')