backend-api/app/Controllers/Api/Kategori.php

    public function index()
    {
        $model = new KategoriModel();
        $data['kategori'] = $model->findAll();
---
SELECT *
FROM `kategori`