backend-api/app/Controllers/Api/Statistik.php

SELECT *
FROM `anggota`
SELECT *
FROM `kategori`
SELECT *
FROM `peminjaman`
WHERE `status` = 'dipinjam'
SELECT *
FROM `peminjaman`
WHERE `status` = 'dikembalikan'
---
    public function index()
    {
        $bukuModel       = new BukuModel();
        $kategoriModel   = new KategoriModel();
        $anggotaModel    = new AnggotaModel();
        $peminjamanModel = new PeminjamanModel();

        $data = [
            'total_buku'         => count($bukuModel->findAll()),
            'total_anggota'      => count($anggotaModel->findAll()),
            'total_kategori'     => count($kategoriModel->findAll()),
            'sedang_dipinjam'    => count($peminjamanModel->where('status', 'dipinjam')->findAll()),
            'sudah_dikembalikan' => count($peminjamanModel->where('status', 'dikembalikan')->findAll()),