Lab_ci4/backend-api/app/Models/BukuModel.php

    public function getBukuDenganKategori()
    {
        return $this->db->table('buku')
                    ->select('buku.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id = buku.kategori_id')
                    ->get()
                    ->getResultArray();
---
SELECT `buku`.*, `kategori`.`nama_kategori`
FROM `buku`
JOIN `kategori` ON `kategori`.`id` = `buku`.`kategori_id`