backend-api/app/Models/PeminjamanModel.php

    public function getPeminjamanDenganRelasi()
    {
        return $this->db->table('peminjaman')
                    ->select('peminjaman.*, anggota.nama as nama_anggota, buku.judul as judul_buku')
                    ->join('anggota', 'anggota.id = peminjaman.anggota_id')
                    ->join('buku', 'buku.id = peminjaman.buku_id')
                    ->get()
                    ->getResultArray();
---
SELECT `peminjaman`.*, `anggota`.`nama` as `nama_anggota`, `buku`.`judul` as `judul_buku`
FROM `peminjaman`
JOIN `anggota` ON `anggota`.`id` = `peminjaman`.`anggota_id`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`