Lab_ci4/backend-api/app/Controllers/Api/Anggota.php

    public function index()
    {
        $model = new AnggotaModel();
        $data['anggota'] = $model->findAll();
---
SELECT *
FROM `anggota`