Lab_ci4/backend-api/app/Controllers/Api/Buku.php

INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`, `stok`, `kategori_id`) VALUES ('IPA', 'ONE', 'Bandai', 2000, 3, '3')
---
    public function create()
    {
        $model = new BukuModel();
        $json  = $this->request->getJSON(true) ?? [];
        $data = [
            'judul'        => $json['judul']        ?? $this->request->getVar('judul'),
            'penulis'      => $json['penulis']      ?? $this->request->getVar('penulis'),
            'penerbit'     => $json['penerbit']     ?? $this->request->getVar('penerbit'),
            'tahun_terbit' => $json['tahun_terbit'] ?? $this->request->getVar('tahun_terbit'),
            'stok'         => $json['stok']         ?? $this->request->getVar('stok'),
            'kategori_id'  => $json['kategori_id']  ?? $this->request->getVar('kategori_id'),
        ];
        $model->insert($data);