Lab_ci4/backend-api/app/Controllers/Api/Peminjaman.php

    public function update($id = null)
    {
        $model     = new PeminjamanModel();
        $bukuModel = new BukuModel();
        $json      = $this->request->getJSON(true) ?? [];

        $peminjaman = $model->where('id', $id)->first();
        if (!$peminjaman) {
            return $this->failNotFound('Data tidak ditemukan.');
        }

        $statusBaru = $json['status'] ?? $this->request->getVar('status');

        // jika status berubah jadi dikembalikan, tambahkan kembali stok buku
        if ($statusBaru === 'dikembalikan' && $peminjaman['status'] === 'dipinjam') {
            $buku = $bukuModel->where('id', $peminjaman['buku_id'])->first();
            $bukuModel->update($peminjaman['buku_id'], ['stok' => $buku['stok'] + 1]);
        }

        $data = [
            'status'          => $statusBaru,
            'tanggal_kembali' => $json['tanggal_kembali'] ?? $this->request->getVar('tanggal_kembali'),
        ];
        $model->update($id, $data);
---
SELECT *
FROM `peminjaman`
WHERE `id` = '11'
 LIMIT 1
SELECT *
FROM `buku`
WHERE `id` = '18'
 LIMIT 1
UPDATE `buku` SET `stok` = 50
WHERE `buku`.`id` IN ('18')
UPDATE `peminjaman` SET `status` = 'dikembalikan', `tanggal_kembali` = '2026-06-17'
WHERE `peminjaman`.`id` IN ('11')